same here:

```
+ resource "aws_mq_broker" "default" {
      + apply_immediately          = true
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = true
      + broker_name                = "xxx-yyy"
      + deployment_mode            = "ACTIVE_STANDBY_MULTI_AZ"
      + engine_type                = "ActiveMQ"
      + engine_version             = "5.15.10"
      + host_instance_type         = "mq.m5.large"
      + id                         = (known after apply)
      + instances                  = (known after apply)
      + publicly_accessible        = false
      + security_groups            = [
          + "sg-09d790b58e4787ea8",
        ]
      + subnet_ids                 = [
          + "subnet-008800e2b2a9597a8",
          + "subnet-06d3e23c055f892c2",
        ]
      + tags                       = {
          + "app"         = "api"
          + "environment" = "dev"
        }

      + configuration {
          + id       = "c-c628e9f1-187d-47ab-9d1e-cee4a36b1a31"
          + revision = (known after apply)
        }

      + encryption_options {
          + kms_key_id        = "arn:aws:kms:ap-southeast-2:yyy:key/xxx"
          + use_aws_owned_key = false
        }

      + logs {
          + audit   = false
          + general = true
        }

      + maintenance_window_start_time {
          + day_of_week = (known after apply)
          + time_of_day = (known after apply)
          + time_zone   = (known after apply)
        }

      + user {
          + console_access = true
          + groups         = []
          + password       = (sensitive value)
          + username       = "xxx"
        }
    }
```

results in:

```
aws_mq_broker.default: Creating...

Error: BadRequestException: Default VPC not found. Subnet and/or security group IDs may be omitted only if a default VPC exists.
{
  RespMetadata: {
    StatusCode: 400,
    RequestID: "58783193-7289-416e-9884-544023f503a7"
  },
  Message_: "Default VPC not found. Subnet and/or security group IDs may be omitted only if a default VPC exists."
}
```